cmsis-svd/cmsis-svd/data/Infineon/s6e2g2xj.svd
        <!-- REGISTER "CSIO_TDR" -->
        <register>
          <name>CSIO_TDR</name>
          <description>Transmit Data Register</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description>Data</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_BGR" -->
        <register>
          <name>CSIO_BGR</name>
          <description>Baud Rate Generator Registers</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BGR" -->
            <field>
              <name>BGR</name>
              <description>Baud Rate Generator Register</description>
              <msb>14</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_FCR1" -->
        <register>
          <name>CSIO_FCR1</name>
          <description>FIFO Control Register 1</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLSTE" -->
            <field>
              <name>FLSTE</name>
              <description>Re-transmission data lost detect enable bit </description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRIIE" -->
            <field>
              <name>FRIIE</name>
              <description>Received FIFO idle detection enable bit </description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FDRQ" -->
            <field>
              <name>FDRQ</name>
              <description>Transmit FIFO data request bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTIE" -->
            <field>
              <name>FTIE</name>
              <description>Transmit FIFO interrupt enable bit </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSEL" -->
            <field>
              <name>FSEL</name>
              <description>FIFO select bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_FCR0" -->
        <register>
          <name>CSIO_FCR0</name>
          <description>FIFO Control Register 0</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLST" -->
            <field>
              <name>FLST</name>
              <description>FIFO re-transmit data lost flag bit </description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FLD" -->
            <field>
              <name>FLD</name>
              <description>FIFO pointer reload bit </description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSET" -->
            <field>
              <name>FSET</name>
              <description>FIFO pointer save bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL2" -->
            <field>
              <name>FCL2</name>
              <description>FIFO2 reset bit </description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL1" -->
            <field>
              <name>FCL1</name>
              <description>FIFO1 reset bit </description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE2" -->
            <field>
              <name>FE2</name>
              <description>FIFO2 operation enable bit </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE1" -->
            <field>
              <name>FE1</name>
              <description>FIFO1 operation enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_FBYTE1" -->
        <register>
          <name>CSIO_FBYTE1</name>
          <description>FIFO Byte Register 1</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CSIO_FBYTE2" -->
        <register>
          <name>CSIO_FBYTE2</name>
          <description>FIFO Byte Register 2</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CSIO_SCSTR0" -->
        <register>
          <name>CSIO_SCSTR0</name>
          <description>Serial Chip Select Timing Register 0</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CSHD" -->
            <field>
              <name>CSHD</name>
              <description>Serial Chip Select Hold Delay bits</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSTR1" -->
        <register>
          <name>CSIO_SCSTR1</name>
          <description>Serial Chip Select Timing Register 1</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CSSU" -->
            <field>
              <name>CSSU</name>
              <description>Serial Chip Select Setup Delay bits</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
