cmsis-svd/cmsis-svd/data/Infineon/s6e2g2xj.svd
        <!-- REGISTER "RXIPV6_HDRERR_OCTETS" -->
        <register>
          <name>RXIPV6_HDRERR_OCTETS</name>
          <description>Number of bytes received in IPv6 datagrams with header errors (length, version mismatch). The value in the IPv6 header's Length field is used to update this counter.  </description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV6_NOPAY_OCTETS" -->
        <register>
          <name>RXIPV6_NOPAY_OCTETS</name>
          <description>Number of bytes received in IPv6 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv6 header's Length field is used to update this counter. </description>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXUDP_GD_OCTETS" -->
        <register>
          <name>RXUDP_GD_OCTETS</name>
          <description>Number of bytes received in a good UDP segment. This counter (and the counters below) does not count IP header bytes. </description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXUDP_ERR_OCTETS" -->
        <register>
          <name>RXUDP_ERR_OCTETS</name>
          <description>Number of bytes received in a UDP segment that had checksum errors</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXTCP_GD_OCTETS" -->
        <register>
          <name>RXTCP_GD_OCTETS</name>
          <description>Number of bytes received in a good TCP segment </description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXTCP_ERR_OCTETS" -->
        <register>
          <name>RXTCP_ERR_OCTETS</name>
          <description>Number of bytes received in a TCP segment with checksum errors </description>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXICMP_GD_OCTETS" -->
        <register>
          <name>RXICMP_GD_OCTETS</name>
          <description>Number of bytes received in a good ICMP segment </description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXICMP_ERR_OCTETS" -->
        <register>
          <name>RXICMP_ERR_OCTETS</name>
          <description>Number of bytes received in an ICMP segment with checksum errors</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TSCR" -->
        <register>
          <name>TSCR</name>
          <description>Time Stamp Control Register</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <resetMask>0x0107FF3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ATSFC" -->
            <field>
              <name>ATSFC</name>
              <description>Auxiliary Snapshot FIFO Clear</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSENMF" -->
            <field>
              <name>TSENMF</name>
              <description>Enable MAC address for PTP frame filtering</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSPS" -->
            <field>
              <name>TSPS</name>
              <description>SelectPTP packets for taking snapshots</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSMRM" -->
            <field>
              <name>TSMRM</name>
              <description>Enable Snapshot for Messages Relevant to Master</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TETSEM" -->
            <field>
              <name>TETSEM</name>
              <description>Enable Time Stamp Snapshot for Event Messages</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSIP4E" -->
            <field>
              <name>TSIP4E</name>
              <description>Enable Time Stamp Snapshot for IPv4 frames</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSIP6E" -->
            <field>
              <name>TSIP6E</name>
              <description>Enable Time Stamp Snapshot for IPv6 frames</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TETSP" -->
            <field>
              <name>TETSP</name>
              <description>Enable Time Stamp Snapshot for PTP over Ethernet frames</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSV2E" -->
            <field>
              <name>TSV2E</name>
              <description>Enable PTP packet snooping for version 2 format</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSDB" -->
            <field>
              <name>TSDB</name>
              <description>Time Stamp Digital or Binary rollover control</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSEA" -->
            <field>
              <name>TSEA</name>
              <description>Enable Time Stamp for All Frames</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TARU" -->
            <field>
              <name>TARU</name>
              <description>Addend Register Update</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TITE" -->
            <field>
              <name>TITE</name>
              <description>Time Stamp Interrupt Trigger Enable</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSU" -->
            <field>
              <name>TSU</name>
              <description>Time Stamp Update</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSI" -->
            <field>
              <name>TSI</name>
              <description>Time Stamp Initialize</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFCU" -->
            <field>
              <name>TFCU</name>
              <description>Time Stamp Fine or Coarse Update</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSE" -->
            <field>
              <name>TSE</name>
              <description>Time Stamp Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SSIR" -->
        <register>
          <name>SSIR</name>
          <description>Sub-Second Increment Register</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSINC" -->
            <field>
              <name>SSINC</name>
              <description>Sub-Second Increment Value</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STSR" -->
        <register>
          <name>STSR</name>
          <description>System Time - Seconds Register</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSS" -->
            <field>
              <name>TSS</name>
              <description>Time Stamp Second</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
