cmsis-svd/cmsis-svd/data/Infineon/s6e2g2xj.svd
        <!-- REGISTER "MFBOCR" -->
        <register>
          <name>MFBOCR</name>
          <description>Missed Frame and Buffer Overflow Counter Register</description>
          <addressOffset>0x1020</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ONMFF" -->
            <field>
              <name>ONMFF</name>
              <description>Overflow NMFF</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMFF" -->
            <field>
              <name>NMFF</name>
              <description>Number of Missed frame by Ethernet-MAC</description>
              <msb>27</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ONMFH" -->
            <field>
              <name>ONMFH</name>
              <description>Overflow NMFH</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMFH" -->
            <field>
              <name>NMFH</name>
              <description>Number of Missed frame by HOST</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RIWTR" -->
        <register>
          <name>RIWTR</name>
          <description>Receive Interrupt Watchdog Timer Register</description>
          <addressOffset>0x1024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RIWT" -->
            <field>
              <name>RIWT</name>
              <description>RI Watchdog Timer count</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AHBSR" -->
        <register>
          <name>AHBSR</name>
          <description>AHB Status Register</description>
          <addressOffset>0x102C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AHBS" -->
            <field>
              <name>AHBS</name>
              <description>AHB Status</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CHTDR" -->
        <register>
          <name>CHTDR</name>
          <description>Current Host Transmit Descriptor Register</description>
          <addressOffset>0x1048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HTDAP" -->
            <field>
              <name>HTDAP</name>
              <description>Host Transmit Descriptor Address Pointer</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CHRDR" -->
        <register>
          <name>CHRDR</name>
          <description>Current Host Receive Descriptor Register</description>
          <addressOffset>0x104C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HRDAP" -->
            <field>
              <name>HRDAP</name>
              <description>Host Receive Descriptor Address Pointer</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CHTBAR" -->
        <register>
          <name>CHTBAR</name>
          <description>Current Host Transmit Buffer Address Register</description>
          <addressOffset>0x1050</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HTBAR" -->
            <field>
              <name>HTBAR</name>
              <description>Host Transmit Buffer Address Register</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CHRBAR" -->
        <register>
          <name>CHRBAR</name>
          <description>Current Host Receive Buffer Address Register</description>
          <addressOffset>0x1054</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HRBAR" -->
            <field>
              <name>HRBAR</name>
              <description>Host Receive Buffer Address Register</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
