cmsis-svd/cmsis-svd/data/Infineon/s6e2g2xj.svd
        <!-- REGISTER "DDR9" -->
        <register>
          <name>DDR9</name>
          <description>Port input/output Direction Setting Register 9</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of DDR9</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDR9</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDR9</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDR9</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDR9</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDR9</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDRA" -->
        <register>
          <name>DDRA</name>
          <description>Port input/output Direction Setting Register A</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of DDRA</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of DDRA</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of DDRA</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of DDRA</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of DDRA</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of DDRA</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of DDRA</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of DDRA</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of DDRA</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of DDRA</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of DDRA</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDRA</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDRA</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDRA</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDRA</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDRA</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDRB" -->
        <register>
          <name>DDRB</name>
          <description>Port input/output Direction Setting Register B</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of DDRB</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of DDRB</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of DDRB</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDRB</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDRB</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDRB</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDRB</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDRB</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDRC" -->
        <register>
          <name>DDRC</name>
          <description>Port input/output Direction Setting Register C</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PF" -->
            <field>
              <name>PF</name>
              <description>Bit15 of DDRC</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of DDRC</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of DDRC</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of DDRC</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of DDRC</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of DDRC</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of DDRC</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of DDRC</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of DDRC</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of DDRC</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of DDRC</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDRC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDRC</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDRC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDRC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDRD" -->
        <register>
          <name>DDRD</name>
          <description>Port input/output Direction Setting Register D</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDRD</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDRD</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDRD</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDRE" -->
        <register>
          <name>DDRE</name>
          <description>Port input/output Direction Setting Register E</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDRE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDRE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDRE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
